{
  "posts": [
    {
      "id": 1,
      "title": "Liverpool agree world-record fee for Roma goalkeeper Alisson",
      "author": "This Is Anfield",
      "content": "<p>The Reds saw their initial offer of £62.2 million fall short on Tuesday, but continued talks with their Serie A counterparts as they sought to land their priority target. Early reports in Italy on Wednesday morning suggested a new bid of €75 million had been made, which was later corroborated by several English reporters, including the Times’ Paul Joyce, who revealed that an agreement had been reached. Liverpool’s £66.8 million outlay, inclusive of add-ons, will comfortably break the world record for a goalkeeper.</p><p>  The 25-year-old Brazilian is now expected to travel to England to finalise a deal with the Reds, with a medical already being lined up.Though also interested, Chelsea are yet to make a bid—but Thibaut Courtois’ expected switch to Real Madrid is believed to have been held up until the Blues identify his successor.They were, however, linked with both Petr Cech and Kasper Schmeichel on Tuesday, suggesting last season’s fifth-placed side are considering alternatives. Alisson’s arrival will understandably put Loris Karius‘ future in jeopardy and it will be interesting to see if Jurgen Klopp keeps the German as backup, or seeks to loan the ‘keeper out to a team away from the limelight.</p>.",
      "date": "today",
      "time": "current time",
      "image": "https://35fs2746z0hj46u2y02fgsfx-wpengine.netdna-ssl.com/wp-content/uploads/P180603-006-Brazil_Croaita-600x390.jpg"
    },
    {
      "id": 2,
      "title": "Daniel Sturridge expecting to stay at Liverpool and excited for season ahead",
      "author": "This Is Anfield",
      "content": "<p>The England international, who turns 29 in September, has been linked with a move to Besiktas, following a six-month loan at West Brom last season.That loan spell was unsuccessful, falling to injury early on limiting the striker to just six appearances, and the Baggies were relegated from the Premier League. He has since returned for pre-season training amid speculation over his future, and has produced a series of bright displays in a new role behind the centre-forward.</p> <p>This has sparked an unlikely debate over whether Sturridge could resurrect his career under Jurgen Klopp, who is seemingly considering a switch to a 4-2-3-1 formation this season.</p> Speaking to the Mirror ahead of Liverpool’s pre-season friendly at Blackburn, Sturridge expressed his desire to remain on Merseyside.“I see myself staying at Liverpool, hopefully being part of the team week in, week out,” he said. “Pre-season is going well, so for me it’s keeping my head down and building on that. I’m excited about the season ahead and it feels great to be back.” “Pre-season has started well for me and the team,” he added. “I am feeling great and can’t wait to get the season under way. “We have the tour to come where we face some great teams like Man United, Man City and Dortmund.” Given the struggles of both Dominic Solanke and Divock Origi over the past 12 months and into pre-season, and the long-term absence of teenager Rhian Brewster, Klopp is short of reliable attacking options.Whether Sturridge can be described as reliable given his well-documented fitness issues is questionable, but he is certainly proven in terms of quality.In 133 games for Liverpool he has scored 63 goals, with 21 of those coming in 63 appearances under Klopp—who has reiterated that “there is a future” for his No. 15.Though this could differ from the manager’s private stance, Sturridge’s performances this pre-season may prove his worth to Klopp.Having spent a troubled six months back in his native West Midlands, he seems to have acknowledged that Liverpool remain his best prospect, as he is still revered at Anfield.",
      "date": "today",
      "time": "current time",
      "image": "https://35fs2746z0hj46u2y02fgsfx-wpengine.netdna-ssl.com/wp-content/uploads/2018-07-10-189-Tranmere_Liverpool-600x400.jpg"
    },
    {
      "id": 3,
      "title": "Xherdan Shaqiri’s first day at Liverpool FC",
      "author": "Jack Lusby",
      "content": "<p>Shaqiri follows Naby Keita and Fabinho through the Shankly Gates to provide cover and competition for Sadio Mane and Mohamed Salah out wide. The Swiss, who was Stoke’s top goalscorer and assist-maker last season, inherits the No. 23 shirt previously worn by Emre Can, and will be part of the Reds’ pre-season tour of the United States.He is currently on a post-World Cup break in Mykonos, but travelled to England to undergo his medical after a deal was agreed with the Potters.During his scans he discussed Liverpool’s previous Swiss players, Stephane Henchoz and Philipp Degen, and the magnitude of support for the club around the world.After his medical, Shaqiri travelled to Melwood to sign his contract, undergo media duties and meet Jurgen Klopp and his new team-mates.</p><p> These included Keita, Danny Ings, Virgil van Dijk, Joe Gomez and Gini Wijnaldum, while he was reunited with Andreas Kornmayer, who he worked with during his time at Bayern Munich.“I’m very happy to be here and can’t wait to start the season at Anfield, and You’ll Never Walk Alone!” he said, addressing supporters.Shaqiri’s first outing is likely to come in the US, though the meeting with Klopp’s former club Borussia Dortmund on Sunday should come too early.The Reds take on Man City (July 26) and Man United (July 28) before heading to the south of France for a training camp at the end of the month.</p>",
      "date": "today",
      "time": "current time",
      "image": "https://35fs2746z0hj46u2y02fgsfx-wpengine.netdna-ssl.com/wp-content/uploads/ShaqiriWink-324x160.jpg"
    },
    {
      "id": 4,
      "title": "Alex Oxlade-Chamberlain to miss whole of 2018/19 season",
      "author": "Jack Lusby",
      "content": "<p>The 24-year-old suffered a knee ligament injury following a challenge on Aleksandar Kolarov in the Reds’ 5-2 victory over Roma in the Champions League semi-finals in April.Oxlade-Chamberlain subsequently underwent surgery which ruled out for the remainder of the campaign and the England squad for the World Cup. He was reported to have been pencilled in for a comeback towards the end of 2018, but speaking to LiverpoolFC.com, Klopp has revealed the extent of his injury.“It feels like now is an appropriate time to tell people that for Ox this coming season will be about focusing on recovery and rehab,” he said.</p>The manager continued to explain that this is not a setback in Oxlade-Chamberlain’s recovery, but rather the original timeframe set:“We have known this from pretty much the day after he got the injury and after the successful surgery, we were sure of it. “I hope everyone treats this information responsibly.“There has been no change, no setback—it’s exactly on the schedule we expected and planned for. The new information is that we’re now giving more detail publicly.“It is typical of Ox that he didn’t want the news to overshadow the end of the season and, to be quite honest, we thought we could wait and tell people at an appropriate time. “His surgery—which he had on the day of our second leg in Roma—has been completely successful and his recovery has started superbly well.“But the truth of the matter is that we are preparing this season knowing he will not be with us on the pitch for competitive matches for the majority of it.“If we do see him back this season it will be a bonus.”<p>This is a cruel blow for Oxlade-Chamberlain, who had enjoyed an excellent start to life on Merseyside following his £35 million move from Arsenal last summer.Stationed his preferred midfield role, the Englishman scored five goals and assisted a further eight in 42 appearances, providing Klopp with added thrust moving forward.While Klopp added that “we will wait for him,” his absence underlines the importance of Liverpool signing another attacking midfielder this summer. While the Reds have already added both Fabinho and Naby Keita to Klopp’s squad, the pursuit of Lyon captain Nabil Fekir signalled the manager’s desire to overhaul his midfield entirely. It has been claimed that a revived deal for Fekir is in the works, though this remains dubious at this stage.</p>",
      "date": "today",
      "time": "current time",
      "image": "https://35fs2746z0hj46u2y02fgsfx-wpengine.netdna-ssl.com/wp-content/uploads/170913-219-Liverpool_Seville-e1522852425849-600x401.jpg"
    },
    {
      "id": 5,
      "title": "Predicting how Liverpool will line up for pre-season friendly at Blackburn",
      "author": "Joel Rabinowitz",
      "content": "</p>The Reds have beaten Chester and Tranmere 7-0 and 3-2 respectively so far, before a 0-0 draw against League Two outfit, Bury, last time out.Klopp will be keen to ensure standards do not slip, as Liverpool haven’t quite been at the races in the last two friendlies, while Blackburn will provide the sternest opposition so far. Gini Wijnaldum is an injury doubt having trained separately from the rest of the squad during the week, while Harry Wilson will no longer be available for selection after completing a season-long loan move to Derby County.Danny Ward has been guaranteed a start in this fixture and could play the full 90 minutes, but suggestions that he would be given the opportunity to seize the No.1 spot this season have taken a heavy blow, with Liverpool having agreed a world-record fee to sign Alisson from Roma.</p><p>The back four is likely to be the one which starts the season, given that both Dejan Lovren and Trent Alexander-Arnold will only return to pre-season in August and are unlikely to be deemed ready for the opening fixture.Klopp will want to give that defensive unit time to gel during pre-season, while it would also be useful to see how Fabinho and Naby Keita can strike up an understanding playing together before the start of the new campaign – while Curtis Jones has been a standout feature of pre-season so far.Rafael Camacho and Sheyi Ojo provide youthful pace and trickery out wide, and Daniel Sturridge will hope to continue his push to earn a place in Klopp’s plans for this season after an impressive string of performances in pre-season so far.Ward is likely to play in both halves, and Nathaniel Clyne could do with building up his match fitness as much as possible after he missed almost the entirety of last season with injury, and given the likelihood he will be needed at the start of the season. Gomez, meanwhile, could be given a chance to shine at centre back, a position which is deemed his most natural long-term role, but one in in which he hasn’t fully convinced so far.There are very few links to any centre-back targets for Liverpool, and if Gomez can step up in that position this season, he has a chance of pushing himself ahead of Joel Matip and Ragnar Klavan in the pecking order.In midfield, Adam Lallana also needs to rack up plenty of minutes after his own injury-hit campaign last time out, while Ben Woodburn can offer the creative spark in a central position in which he has shown encouraging signs of late, where his lack of raw pace is less evident and his vision and dribbling ability can shine through.</p>",
      "date": "today",
      "time": "current time",
      "image": "https://35fs2746z0hj46u2y02fgsfx-wpengine.netdna-ssl.com/wp-content/uploads/P180710-034-Tranmere_v_Liverpool-600x400.jpg"
    },
    {
      "id": 7,
      "title": "Lyon president open to fresh talks with Liverpool over Nabil Fekir deal",
      "author": "Jack Lusby",
      "content": "<p>Aulas has taken a decidedly public role in negotiations over Fekir’s future, swaying from emphatic declarations of the player’s commitment to claiming interest from Man United and Real Madrid.The 69-year-old insisted at the end of June that the Ligue 1 club “have the means to keep” their captain, and that they “do not let anyone go to have the best team.”</p><p>Speaking to RMC Sport last week, Aulas said he expected Fekir to stay at Parc Olympique Lyonnais after having given him “the opportunity to join Liverpool because of their legendary status.” This was followed by claims from Loic Tanzi, a journalist for the same outlet, that the Reds would revive their interest after the World Cup—a stance furthered by the Mirror‘s David Maddock.Responding to this speculation in an interview with Le Progres, Aulas stressed that Fekir “still has his heart in Lyon,” but then added “maybe he will go to Liverpool, or to another club.” “It seems to me that Liverpool could come back to the table. That’s what I saw in the press, but I’m not informed,” he explained.“His transfer failed in June, but he is not affected.</p> He is quite fatalistic, focused on his World Cup, and he still has his heart in Lyon.“We spoke to his brother, Yassin. Nabil is much closer to Lyon today than he was when we talked to Liverpool. “Maybe he will go to Liverpool, or to another club, but if he stays at Lyon it will be a great year for him and for us.” Fekir is likely to be on the substitutes’ bench for France in Sunday’s World Cup final against Croatia, and his involvement in Russia has stalled any progress with a deal.But he has already completed a medical with Liverpool, which led to the breakdown in their deal, as well as undergoing media duties with the club and agreeing a five-year contract worth £120,000 a week.If Liverpool are to reopen talks with Lyon, and the French side are clearly willing to do so, it could prove relatively straightforward.The Reds have already signed Fabinho, Naby Keita and Xherdan Shaqiri this summer, but Jurgen Klopp‘s priority is to secure a long-term successor to Philippe Coutinho.Fekir fits the mould perfectly, and Liverpool have seemingly not identified any alternatives beyond West Ham‘s Manuel Lanzini, who is sidelined until next year with a knee injury.",
      "date": "today",
      "time": "current time",
      "image": "https://35fs2746z0hj46u2y02fgsfx-wpengine.netdna-ssl.com/wp-content/uploads/PA-33364439-600x416.jpg"
    },
    {
      "title": "sdfgh",
      "Author": "sdfghn",
      "datetime": "2018-07-11",
      "content": "<p>sdfghjklo;lkjhgfd</p>",
      "id": 8
    }
  ]
}